/*ДЗ 1

Вам необхідно намалювати в консолі прямокутний трикутник із зірочок (або плюсиків, або якогось іншого символу):
на першому рядку - одна зірочка, на другій дві, і так далі. Рішення оформіть у вигляді функції,
куди передаються два параметри: висота трикутника та символ, яким його потрібно "малювати".
Якось так: drawTriangle(5, *);
*
**
***
****
*****
Умови виконання ДЗ
Домашню роботу необхідно зробити двома способами
В задачі не потрібно використовувати prompt або щось інше повязане з UI
Не використовувати функції або інші матеріали які ми не вивчали
Намагайтесь робити ДЗ самостійно та не дивитися будьякі підказки
Будь ласка, надайте наступні дані для перевірки вашої роботи:
Створіть гілку js_homework3.
Додати туди ваше домашне завдання
Вислати вашу гілку*/

let star = '*';
let str = '';
for (let i = 0; i < 6; i++) {
    for (let j= 0; j < i; j++) {
        str += star;
    }
    str +='\n';
}
console.log(str);



/*ДЗ 2

Вивести на екран суму чисел від 1 до 100 включно, які не кратні 3.
Умови виконання ДЗ
Не використовувати функції або інші матеріали які ми не вивчали
Намагайтесь робити ДЗ самостійно та не дивитися будьякі підказки
Будь ласка, надайте наступні дані для перевірки вашої роботи:
Створіть гілку js_homework3.
Додати туди ваше домашне завдання
Вислати вашу гілку*/

let sum = 0
for (let num = 1; num >= 1 && num <= 100; num++ ) {
    if (num % 3 !== 0){
        sum += num
    }
}
console.log(sum)



/*ДЗ 3:

Написати функцію pow(x,y) яка буде приймати 2 цисла, перше це число яке ми будемо зводити у ступінь, друге у яку ступінь.
Наприклад pow(2,3) функція поверне значення 8.
Умови виконання ДЗ
Не використовувати **
Не використовувати функції або інші матеріали які ми не вивчали
Намагайтесь робити ДЗ самостійно та не дивитися будьякі підказки
Будь ласка, надайте наступні дані для перевірки вашої роботи:
Створіть гілку js_homework3.
 Додати туди ваше домашне завдання
Вислати вашу гілку*/

var number = 2 //'число яке ми будемо зводити у ступінь';
var degree = 4//'ступінь';
let result = 1;

function exponentiation(){
    while (degree) {
        result = number * result;
        degree = degree - 1;
    }
    return result;
}
console.log(exponentiation(result));
